tap "theboredteam/boring-notch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Fast and secure open-source backup
brew "kopia"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Development kit for the Java programming language
brew "openjdk@21"
# Multithreaded PNG optimizer written in Rust
brew "oxipng"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Send any size file between devices
cask "blip"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Window peeking utility app
cask "dockdoor"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Chromium-based web browser
cask "helium-browser"
# Utility to hide menu bar items
cask "hiddenbar"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Menu bar manager
cask "jordanbaird-ice"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Backup/restore tool
cask "kopiaui"
# Utility that shows the latest app updates
cask "latest"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for rsync
cask "rsyncui"
# Open source virtual/remote desktop application
cask "rustdesk"
# Screenshot measurement and annotation tool
cask "shottr"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Menu bar manager
cask "thaw"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
vscode "aaron-bond.better-comments"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.java"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
